local ErrorId = {}
 
--[[--]]
ErrorId[-1] = "非法操作"
--[[服务器Id验证开启了--]]
ErrorId[2001001] = "服务器Id错误"
--[[服务器关闭注册--]]
ErrorId[2001002] = "服务器爆满，请前往新服畅玩！"
--[[服务器关闭!--]]
ErrorId[2001003] = "服务器关闭!"
--[[--]]
ErrorId[2001004] = "维护中"
--[[--]]
ErrorId[2030101] = "无效礼包码"
--[[--]]
ErrorId[2030102] = "SIGN失败"
--[[--]]
ErrorId[2030103] = "激活码已被使用"
--[[--]]
ErrorId[2030106] = "不在渠道范围"
--[[--]]
ErrorId[2030107] = "礼包码失效"
--[[--]]
ErrorId[2030108] = "特权未激活"
--[[--]]
ErrorId[2030109] = "今日已签到"
--[[--]]
ErrorId[2030110] = "未能签到"
--[[--]]
ErrorId[2030111] = "已经领取过"
--[[--]]
ErrorId[2030112] = "今日未充值"
--[[--]]
ErrorId[2030113] = "累计签到天数不足"
--[[--]]
ErrorId[2030114] = "活动已结束"
--[[--]]
ErrorId[2030115] = "奖励已经领完"
--[[--]]
ErrorId[2030116] = "购买物品已过期"
--[[--]]
ErrorId[2030117] = "未充值过，请先充值"
--[[--]]
ErrorId[2030118] = "次数已用完"
--[[--]]
ErrorId[2030119] = "宝树已满级"
--[[--]]
ErrorId[2030120] = "招财次数已用完"
--[[--]]
ErrorId[2030121] = "没有更多物品可以取出了"
--[[--]]
ErrorId[2030122] = "剩余数量不足！"
--[[--]]
ErrorId[2030123] = "每波礼物最多采集5个"
--[[本期vip购买次数已达上限!--]]
ErrorId[2030124] = "当前批已购买次数达到上限，请提高VIP等级，或者等待下一批云购"
--[[--]]
ErrorId[2030125] = "非活动时间"
--[[--]]
ErrorId[2030126] = "赠送次数不足"
--[[--]]
ErrorId[2030127] = "礼物已送完"
--[[无效的邀请码!--]]
ErrorId[2030128] = "无效的邀请码!"
--[[--]]
ErrorId[2030129] = "这道题已经答过了"
--[[--]]
ErrorId[2030130] = "时间已过，不可领取！"
--[[--]]
ErrorId[2030131] = "vip等级不足"
--[[--]]
ErrorId[2030132] = "本次采集进度已满，无法继续采集"
--[[变身id不存在--]]
ErrorId[2101001] = "变身id不存在"
--[[--]]
ErrorId[2101002] = "该场景不允许切换模式"
--[[--]]
ErrorId[2101003] = "满血状态"
--[[--]]
ErrorId[2101004] = "玩家在线不可抢夺"
--[[--]]
ErrorId[2101005] = "抢夺次数不足"
--[[眩晕状态,不能释放技能!--]]
ErrorId[2101006] = "眩晕状态,不能释放技能!"
--[[眩晕状态,不能移动!--]]
ErrorId[2101007] = "眩晕状态,不能移动!"
--[[定身状态,不能移动!--]]
ErrorId[2101008] = "定身状态,不能移动!"
--[[冰冻状态,不能释放技能!--]]
ErrorId[2101009] = "冰冻状态,不能释放技能!"
--[[冰冻状态,不能移动!--]]
ErrorId[2101010] = "冰冻状态,不能移动!"
--[[技能冷却中!--]]
ErrorId[2101011] = "技能冷却中!"
--[[对方正在复活保护中!--]]
ErrorId[2101012] = "对方正在复活保护中!"
--[[对方为和平pk模式,不能被攻击!--]]
ErrorId[2101013] = "对方为和平pk模式,不能被攻击!"
--[[对方在安全区域,不能被攻击!--]]
ErrorId[2101014] = "对方在安全区域,不能被攻击!"
--[[安全区域不能攻击其他玩家!--]]
ErrorId[2101015] = "安全区域不能攻击其他玩家!"
--[[对方无敌免伤状态!--]]
ErrorId[2101016] = "对方无敌免伤状态!"
--[[技能次数不足!--]]
ErrorId[2101017] = "技能次数不足!"
--[[--]]
ErrorId[2101018] = "五行不足，无法造成伤害"
--[[--]]
ErrorId[2101019] = "移动速度太快了！"
--[[喇叭不足!--]]
ErrorId[2203001] = "喇叭不足!"
--[[一键赠送爱心--]]
ErrorId[2203002] = "没有可赠送好友"
--[[一键提醒好友赠送爱心--]]
ErrorId[2203003] = "没有可提醒的在线好友"
--[[一键领取爱心--]]
ErrorId[2203004] = "没有可领取的爱心"
--[[好友数量已达上限!--]]
ErrorId[2203005] = "好友数量已达上限!"
--[[黑名单已达上限!--]]
ErrorId[2203006] = "黑名单已达上限!"
--[[仇人数量已达上限!--]]
ErrorId[2203007] = "仇人数量已达上限!"
--[[--]]
ErrorId[2203008] = "今日赠送已达上限"
--[[--]]
ErrorId[2203009] = "今日领取爱心已达上限"
--[[已在黑名单中!--]]
ErrorId[2203010] = "已在黑名单中!"
--[[--]]
ErrorId[2203011] = "魅力值不足"
--[[对方不在线,不能私聊!--]]
ErrorId[2203012] = "对方不在线"
--[[存在非法字符!--]]
ErrorId[2203013] = "存在非法字符!"
--[[--]]
ErrorId[2203014] = "对方已赠送"
--[[--]]
ErrorId[2203015] = "好友已存在"
--[[--]]
ErrorId[2203016] = "好友已经在黑名单中"
--[[--]]
ErrorId[2203017] = "好友已在申请列表中"
--[[--]]
ErrorId[2203018] = "聊天次数已达上限"
--[[--]]
ErrorId[2203019] = "请先将对方移出黑名单"
--[[--]]
ErrorId[2203020] = "对方好友列表已满"
--[[好友列表已满，请清理后添加!--]]
ErrorId[2203021] = "好友列表已满，请清理后添加!"
--[[--]]
ErrorId[2203022] = "你们是夫妻关系无法删除对方好友"
--[[--]]
ErrorId[2203023] = "你们是夫妻关系无法添加对方到黑名单"
--[[--]]
ErrorId[2203024] = "不能添加自己为好友"
--[[--]]
ErrorId[2203025] = "今日发送私聊已超过上限！"
--[[当前时段世界聊天次数已达上限!--]]
ErrorId[2203026] = "当前时段世界聊天次数已达上限!"
--[[您最近私聊发言太频繁,已被系统禁言一段时间!--]]
ErrorId[2203027] = "发言违规，已被禁言，如有疑问请联系客服"
--[[等级差距过大,无法与对方私聊!--]]
ErrorId[2203028] = "等级差距过大,无法与对方私聊!"
--[[--]]
ErrorId[2203029] = "离线私聊不能发语音"
--[[--]]
ErrorId[2203030] = "队伍喊话冷却中！"
--[[--]]
ErrorId[2203031] = "只能私聊好友！"
--[[对方今天添加好友已达上限!--]]
ErrorId[2203032] = "对方今天添加好友已达上限!"
--[[--]]
ErrorId[2203033] = "达到VIP2即可发言"
--[[--]]
ErrorId[2203034] = "该时间段内聊天功能维护中"
--[[--]]
ErrorId[2203035] = "特殊场景中，不可使用"
--[[--]]
ErrorId[2203036] = "当前玩家处于离线状态不能进行追杀"
--[[--]]
ErrorId[2203037] = "对方在特殊场景，无法使用"
--[[--]]
ErrorId[2203038] = "没有红名值"
--[[对方拒绝好友申请--]]
ErrorId[2203039] = "对方拒绝好友申请"
--[[装备部位强化已达上限!--]]
ErrorId[2204001] = "装备部位强化已达上限!"
--[[装备部位升星已达上限!--]]
ErrorId[2204002] = "装备部位升星已达上限!"
--[[--]]
ErrorId[2204003] = "称号未激活"
--[[--]]
ErrorId[2204004] = "时装未激活"
--[[--]]
ErrorId[2204005] = "装备位置已经发生改变，请从背包穿戴"
--[[--]]
ErrorId[2204006] = "等级不足，合成失败"
--[[--]]
ErrorId[2204007] = "等级不够无法升级宝石！"
--[[--]]
ErrorId[2204008] = "没有可以镶嵌的宝石"
--[[--]]
ErrorId[2204009] = "宝石已经升到最高级"
--[[--]]
ErrorId[2204010] = "请先选择一个部位"
--[[--]]
ErrorId[2204011] = "没有可以升级的宝石"
--[[--]]
ErrorId[2204012] = "装备不同阶！"
--[[--]]
ErrorId[2204013] = "装备品质不同！"
--[[--]]
ErrorId[2204014] = "装备已穿戴！"
--[[--]]
ErrorId[2204015] = "装备星数不一致！"
--[[--]]
ErrorId[2204016] = "装备品质太低！"
--[[--]]
ErrorId[2204017] = "装备阶数太低！"
--[[--]]
ErrorId[2204018] = "装备星数太低！"
--[[--]]
ErrorId[2204019] = "装备已锻造！"
--[[--]]
ErrorId[2204020] = "请先锻造成诛仙装！"
--[[该道具性别不符,无法使用!--]]
ErrorId[2204021] = "该道具性别不符,无法使用!"
--[[您已经拥有了该套装!--]]
ErrorId[2204022] = "您已激活该时装，可到对应界面升星！"
--[[--]]
ErrorId[2204023] = "时装已升至最大星！"
--[[--]]
ErrorId[2204024] = "已经存在同类型符文"
--[[--]]
ErrorId[2204025] = "符文孔未开启"
--[[--]]
ErrorId[2204026] = "符文经验不足"
--[[--]]
ErrorId[2204027] = "当前强化已最大，换更高品质圣印可以提升强化上限"
--[[--]]
ErrorId[2205001] = "技能升级已达上限"
--[[--]]
ErrorId[2205002] = "技能未激活"
--[[--]]
ErrorId[2205003] = "天赋点不足"
--[[--]]
ErrorId[2205004] = "本系天赋点不足"
--[[--]]
ErrorId[2205005] = "天赋技能已达最大值"
--[[--]]
ErrorId[2205006] = "没有加天赋点"
--[[--]]
ErrorId[2205007] = "技能等级条件不足"
--[[--]]
ErrorId[2205008] = "已达最大阶"
--[[--]]
ErrorId[2205009] = "技能已激活"
--[[--]]
ErrorId[2205010] = "修仙条件未达成"
--[[帮派公告内容过长--]]
ErrorId[2206001] = "仙盟公告内容过长"
--[[已加入过帮派!--]]
ErrorId[2206002] = "已加入过仙盟!"
--[[帮派权限不够,不能执行此操作!--]]
ErrorId[2206004] = "仙盟权限不够,不能执行此操作!"
--[[帮主离线时间尚且不足,不能弹劾!--]]
ErrorId[2206005] = "盟主离线时间不足72小时,弹劾失败!"
--[[退出帮派一天后才能重新加入帮派!--]]
ErrorId[2206006] = "退出仙盟一天后才能重新加入新的仙盟!"
--[[宝箱已经被协助过了!--]]
ErrorId[2206007] = "宝箱已经被协助过了!"
--[[帮派该职位已满!--]]
ErrorId[2206008] = "仙盟该职位已满!"
--[[帮派成员已满!--]]
ErrorId[2206009] = "仙盟成员已满!"
--[[公告内容存在非法字符!--]]
ErrorId[2206010] = "公告内容存在非法字符!"
--[[帮派中不存在该玩家!--]]
ErrorId[2206011] = "仙盟中不存在该玩家!"
--[[帮派仓库已满!--]]
ErrorId[2206012] = "仙盟仓库已满!长老以上职位可清理!"
--[[帮派仓库存入次数已达上限!--]]
ErrorId[2206013] = "仙盟今日仓库存入次数已达上限!"
--[[帮派仓库取出已达上限!--]]
ErrorId[2206014] = "仙盟仓库今日取出次数已达上限!"
--[[请在10点后开启宝箱!--]]
ErrorId[2206015] = "请在10点后开启宝箱!"
--[[请先加入帮派!--]]
ErrorId[2206016] = "请先加入仙盟!"
--[[对方已加入帮派!--]]
ErrorId[2206017] = "对方已加入仙盟!"
--[[--]]
ErrorId[2206018] = "红包已过期"
--[[仙盟战期间不能进行此操作!--]]
ErrorId[2206019] = "仙盟战期间不能进行此操作!"
--[[宝箱已过期!--]]
ErrorId[2206020] = "宝箱已过期!"
--[[不能存放绑定道具!--]]
ErrorId[2206021] = "不能存放绑定道具!"
--[[等级不够不能加入帮派!--]]
ErrorId[2206022] = "等级不足，无法申请加入仙盟!"
--[[--]]
ErrorId[2206023] = "今日红包已领取绑元达到最大"
--[[--]]
ErrorId[2206024] = "仙盟等级不足，无法宣战"
--[[--]]
ErrorId[2206025] = "未到城战宣战时间"
--[[--]]
ErrorId[2206026] = "该城池不可宣战"
--[[--]]
ErrorId[2206027] = "城池已经宣战"
--[[--]]
ErrorId[2206028] = "皇城争夺未开启"
--[[--]]
ErrorId[2206029] = "没有宣战不可进入"
--[[--]]
ErrorId[2206030] = "已经在当前城池"
--[[--]]
ErrorId[2206031] = "奖励已领取"
--[[--]]
ErrorId[2206032] = "未取得城战胜利"
--[[--]]
ErrorId[2206033] = "该城战争夺已结束"
--[[--]]
ErrorId[2206034] = "组队状态不能进该场景"
--[[--]]
ErrorId[2206035] = "对方仙盟盟主拒绝了你的申请"
--[[--]]
ErrorId[2206036] = "对方仙盟可接收人数低于我方仙盟总人数，申请加入失败"
--[[--]]
ErrorId[2206037] = "城战期间不可合并"
--[[--]]
ErrorId[2206038] = "公告维护中，不可修改"
--[[--]]
ErrorId[2206039] = "仙盟未在皇城争夺战中取的连胜，不可分配"
--[[--]]
ErrorId[2206040] = "仙盟未在皇城争夺战中取的终结次数"
--[[--]]
ErrorId[2206041] = "神兽祭坛时间不可参与圣火活动"
--[[--]]
ErrorId[2207001] = "道具已下架"
--[[--]]
ErrorId[2207002] = "道具已售罄"
--[[--]]
ErrorId[2207003] = "上架道具已达上限"
--[[--]]
ErrorId[2207004] = "不能购买自己的物品"
--[[--]]
ErrorId[2207005] = "道具数量不足"
--[[--]]
ErrorId[2207006] = "物品已被他人购买"
--[[--]]
ErrorId[2207007] = "密码次数错误超过三次，不能购买"
--[[--]]
ErrorId[2207008] = "物品名称为空"
--[[--]]
ErrorId[2207009] = "上阵宠物不可交易，请先将宠物下阵"
--[[今日副本挑战次数已用完!--]]
ErrorId[2208001] = "今日副本挑战次数已用完!"
--[[未达到进入副本等级!--]]
ErrorId[2208002] = "未达到进入副本等级!"
--[[请先通关前面的关卡!--]]
ErrorId[2208003] = "请先通关前面的关卡!"
--[[组队状态下不能进入副本!--]]
ErrorId[2208004] = "组队状态下不能进入副本!"
--[[购买加成时间不能超过挂机时间!--]]
ErrorId[2208005] = "购买加成时间不能超过挂机时间!"
--[[已达到每日购买上限--]]
ErrorId[2208006] = "已达到每日购买上限"
--[[--]]
ErrorId[2208007] = "今日重置次数已用完"
--[[该采集物其他人正在采集!--]]
ErrorId[2208008] = "该采集物其他人正在采集!"
--[[该采集物已被采集完!--]]
ErrorId[2208009] = "该采集物已被采集完!"
--[[皇陵之战暂未开启!--]]
ErrorId[2208010] = "皇陵行暂未开启!"
--[[--]]
ErrorId[2208011] = "九重天暂未开启"
--[[--]]
ErrorId[2208012] = "组队状态不能进入九重天"
--[[夫妻组队才能挑战次副本!--]]
ErrorId[2208013] = "夫妻组队才能挑战次副本!"
--[[组队才能挑战次副本!--]]
ErrorId[2208014] = "组队才能挑战次副本!"
--[[点击太快了,正在进入副本中!--]]
ErrorId[2208015] = "点击太快了,正在进入副本中!"
--[[跨服组队下不能进入副本!--]]
ErrorId[2208016] = "跨服组队下不能进入副本!"
--[[队伍玩家在副本里面,不能渡劫!--]]
ErrorId[2208017] = "队伍玩家在副本里面,不能渡劫!"
--[[仙魔战暂未开启!--]]
ErrorId[2208018] = "仙魔战暂未开启!"
--[[--]]
ErrorId[2208019] = "入场券不足！"
--[[--]]
ErrorId[2208020] = "秘境修炼中才可使用"
--[[--]]
ErrorId[2208021] = "需要购买黄金仙尊或钻石仙尊"
--[[--]]
ErrorId[2208022] = "利刃伤害最高加成100%"
--[[--]]
ErrorId[2208023] = "队伍已进入副本"
--[[--]]
ErrorId[2208024] = "今日副本次数已达最大，请先使用完"
--[[--]]
ErrorId[2208025] = "已经有一个了，不能太贪心"
--[[--]]
ErrorId[2208026] = "已达该货币类型的最大购买上限"
--[[--]]
ErrorId[2208027] = "请保持冷静选择"
--[[在特殊场景中,不允许挑战该副本!--]]
ErrorId[2208028] = "在特殊场景中,不允许挑战该副本!"
--[[对方在特殊场景中,不允许挑战该副本!--]]
ErrorId[2208029] = "对方在特殊场景中,不允许挑战该副本!"
--[[--]]
ErrorId[2208030] = "扫荡条件未满足！"
--[[--]]
ErrorId[2208031] = "少侠该桌酒宴已经被吃完，请静候一下桌！"
--[[宝箱位置已用完,请稍后尝试!--]]
ErrorId[2208032] = "宝箱位置已用完,请稍后尝试!"
--[[不能采集别人的宝箱!--]]
ErrorId[2208033] = "不能采集别人的宝箱!"
--[[--]]
ErrorId[2208034] = "获取次数达到上限"
--[[--]]
ErrorId[2208035] = "本次挑战尚未获得奖励，不能再次获取"
--[[神兽圣域活动期间不能执行该操作！--]]
ErrorId[2208036] = "神兽圣域活动期间不能执行该操作！"
--[[--]]
ErrorId[2208037] = "您已经参加过此活动，不可再参加"
--[[正在交易中!--]]
ErrorId[2209001] = "正在交易中!"
--[[对方正在交易中!--]]
ErrorId[2209002] = "对方正在交易中!"
--[[上一次交易还没结束!--]]
ErrorId[2209003] = "上一次交易还没结束!"
--[[交易中不能整理!--]]
ErrorId[2209004] = "交易中不能整理!"
--[[改物品正在交易中!--]]
ErrorId[2209005] = "该物品正在交易中!"
--[[对方不在线!--]]
ErrorId[2209006] = "对方不在线!"
--[[每日交易元宝已超过上限!--]]
ErrorId[2209007] = "每日交易元宝已超过上限!"
--[[交易超时!--]]
ErrorId[2209008] = "交易超时!"
--[[该物品已经超过每日交易上限!--]]
ErrorId[2209009] = "该物品已经超过每日交易上限!"
--[[对方该物品已经达到交易上限!--]]
ErrorId[2209010] = "对方该物品已经达到交易上限!"
--[[对方今日交易元宝已达上限!--]]
ErrorId[2209011] = "对方今日交易元宝已达上限!"
--[[--]]
ErrorId[2209012] = "密码长度不正确"
--[[--]]
ErrorId[2209013] = "密码包含非数字"
--[[--]]
ErrorId[2209014] = "密码错误"
--[[--]]
ErrorId[2209015] = "宠物系统未开发"
--[[--]]
ErrorId[2209016] = "交易受限！"
--[[已经加入了队伍!--]]
ErrorId[2210001] = "已经加入了队伍!"
--[[队伍人数已满!--]]
ErrorId[2210002] = "队伍人数已满!"
--[[该队伍不存在!--]]
ErrorId[2210003] = "该队伍不存在!"
--[[不是队长不能执行此操作!--]]
ErrorId[2210004] = "队长才有权限进行此操作"
--[[对方已加入队伍!--]]
ErrorId[2210005] = "对方已加入队伍!"
--[[少侠,请骚后尝试申请!--]]
ErrorId[2210006] = "已发送邀请，等待对方同意中！"
--[[对方不在线!--]]
ErrorId[2210007] = "对方不在线!"
--[[对方不在同一场景,不能邀请!--]]
ErrorId[2210008] = "对方距离太远,无法邀请!"
--[[暂时没有可加入的队伍--]]
ErrorId[2210009] = "暂时没有可加入的队伍"
--[[--]]
ErrorId[2210010] = "对方等级不足"
--[[该场景不能创建队伍!--]]
ErrorId[2210011] = "该场景不能创建队伍!"
--[[对方所在场景不允许组队!--]]
ErrorId[2210012] = "对方所在场景不允许组队!"
--[[该场景不能邀请他人组队!--]]
ErrorId[2210013] = "该场景不能邀请他人组队!"
--[[--]]
ErrorId[2210014] = "该玩家在其他副本活动，不能接受邀请"
--[[--]]
ErrorId[2210015] = "该场景不允许加入副本组队"
--[[--]]
ErrorId[2210016] = "对方拒绝了你的组队邀请"
--[[--]]
ErrorId[2210017] = "队伍等级设定无效"
--[[不满足队伍等级区间!--]]
ErrorId[2210018] = "不满足队伍等级区间!"
--[[竞技场刷新冷却中!--]]
ErrorId[2220001] = "竞技场刷新冷却中!"
--[[挑战时间未冷却完毕!--]]
ErrorId[2220002] = "挑战时间未冷却完毕!"
--[[挑战次数不足!--]]
ErrorId[2220003] = "挑战次数不足!"
--[[--]]
ErrorId[2220004] = "不能挑战自己"
--[[--]]
ErrorId[2220005] = "你正在挑战中，无法挑战他人"
--[[--]]
ErrorId[2220006] = "正在刷新，请稍等"
--[[--]]
ErrorId[2220007] = "当前场景不可挑战"
--[[--]]
ErrorId[2220008] = "对方被挑战中，请稍后再试！"
--[[--]]
ErrorId[2220009] = "对方未在探索中"
--[[--]]
ErrorId[2220010] = "您正在挑战中，无法继续挑战其他玩家"
--[[挑战次数不足!--]]
ErrorId[2230001] = "剩余疲劳值不足!"
--[[宝箱已被他人拾取!--]]
ErrorId[2230002] = "宝箱已被他人拾取!"
--[[--]]
ErrorId[2230003] = "剩余次数不足"
--[[剩余购买次数不足!--]]
ErrorId[2230004] = "剩余购买次数不足!"
--[[--]]
ErrorId[2230005] = "精力值已满"
--[[--]]
ErrorId[2240001] = "灵童系统未开启"
--[[--]]
ErrorId[2240002] = "坐骑系统未开启"
--[[--]]
ErrorId[2240003] = "仙羽系统未开启"
--[[--]]
ErrorId[2240004] = "神兵系统未开启"
--[[--]]
ErrorId[2240005] = "仙器系统未开启"
--[[--]]
ErrorId[2240006] = "法宝系统未开启"
--[[--]]
ErrorId[2240007] = "灵羽系统未开启"
--[[--]]
ErrorId[2240008] = "灵兵系统未开启"
--[[--]]
ErrorId[2240009] = "灵器系统未开启"
--[[--]]
ErrorId[2240010] = "灵宝系统未开启"
--[[--]]
ErrorId[2240020] = "灵童未激活"
--[[--]]
ErrorId[2240021] = "坐骑未激活"
--[[--]]
ErrorId[2240022] = "仙羽未激活"
--[[--]]
ErrorId[2240023] = "神兵未激活"
--[[--]]
ErrorId[2240024] = "仙器未激活"
--[[--]]
ErrorId[2240025] = "法宝未激活"
--[[--]]
ErrorId[2240026] = "灵羽未激活"
--[[--]]
ErrorId[2240027] = "灵兵未激活"
--[[--]]
ErrorId[2240028] = "灵器未激活"
--[[--]]
ErrorId[2240029] = "灵宝未激活"
--[[--]]
ErrorId[2240040] = "系统已满阶"
--[[--]]
ErrorId[2240041] = "已达最大阶"
--[[--]]
ErrorId[2240042] = "系统未激活"
--[[--]]
ErrorId[2240043] = "飞升系统未开启"
--[[仙盟争霸暂未开启!--]]
ErrorId[2250001] = "仙盟争霸暂未开启!"
--[[暂未获得仙盟争霸参赛资格!--]]
ErrorId[2250002] = "暂未获得仙盟争霸参赛资格!"
--[[仙盟争霸已结束!--]]
ErrorId[2250003] = "该轮仙盟争霸已结束!"
--[[--]]
ErrorId[2250004] = "请先退出队伍再进行仙盟争霸"
--[[盟友正在占领，请等待--]]
ErrorId[2250005] = "已被己方仙盟占领"
--[[--]]
ErrorId[2250006] = "盟友正在占领中"
--[[--]]
ErrorId[2250007] = "敌方玩家正在占领，速速击杀"
--[[--]]
ErrorId[2250008] = "非主宰仙盟盟主，不可分配"
--[[--]]
ErrorId[2260001] = "购买后将超过可累积上限，请使用后购买！"
--[[--]]
ErrorId[2270001] = "玩家已下线，无法查看信息"
--[[--]]
ErrorId[2280001] = "条件未达成，无法领取！"
--[[跨服暂未开启!--]]
ErrorId[2290001] = "跨服暂未开启!"
--[[跨服场景中不能使用该道具!--]]
ErrorId[2290002] = "跨服场景中不能使用该道具!"
--[[加入队伍失败,该队伍已开始!--]]
ErrorId[2290003] = "加入队伍失败,该队伍已开始!"
--[[加入队伍失败,该队伍已满员!--]]
ErrorId[2290004] = "加入队伍失败,该队伍已满员!"
--[[该队伍已解散!--]]
ErrorId[2290005] = "该队伍已解散!"
--[[暂时没有队伍可以加入!--]]
ErrorId[2290006] = "暂时没有队伍可以加入!"
--[[队伍成员未准备!--]]
ErrorId[2290007] = "队伍成员未准备!"
--[[队伍已开始,请勿重复点击!--]]
ErrorId[2290008] = "队伍已开始,请勿重复点击!"
--[[跨服服务器正在准备中!--]]
ErrorId[2290009] = "明天即将开启跨服！"
--[[跨服场景不允许骑乘!--]]
ErrorId[2290010] = "跨服场景不允许骑乘!"
--[[跨服场景中不能打坐!--]]
ErrorId[2290011] = "跨服场景中不能打坐!"
--[[三界争霸暂未开启!--]]
ErrorId[2290102] = "三界争霸暂未开启!"
--[[暂无可用宝箱格子!--]]
ErrorId[2290103] = "暂无可用宝箱格子!"
--[[镖车道具刷新已满级!--]]
ErrorId[2290104] = "刷新令最高只能刷到分神仙女！"
--[[今日劫镖已达上限,不会获得奖励!--]]
ErrorId[2290105] = "今日抢劫仙宝已达上限,不会获得奖励!"
--[[跨服剑神殿暂未开启!--]]
ErrorId[2290106] = "跨服剑神殿暂未开启!"
--[[--]]
ErrorId[2290107] = "不可跨服赠送鲜花"
--[[--]]
ErrorId[2300001] = "双方亲密度不足无法求婚"
--[[--]]
ErrorId[2300002] = "您选择的好友已结婚"
--[[--]]
ErrorId[2300003] = "求婚方元宝不足"
--[[--]]
ErrorId[2300004] = "拒绝求婚"
--[[--]]
ErrorId[2300005] = "对方不在线，无法离婚"
--[[--]]
ErrorId[2300006] = "对方拒绝了你的离婚请求"
--[[--]]
ErrorId[2300007] = "求婚请求已过期，求婚失败！"
--[[--]]
ErrorId[2300008] = "已婚不可使用变性道具"
--[[--]]
ErrorId[2300009] = "您正在求婚不能再向其他人求婚。"
--[[--]]
ErrorId[2300010] = "您已结婚，不可向其他人求婚"
--[[--]]
ErrorId[2300011] = "您已结婚，不能再接受其他人的求婚！"
--[[--]]
ErrorId[2300012] = "对方未向您求婚"
--[[--]]
ErrorId[2300013] = "您还未结婚"
--[[--]]
ErrorId[2300014] = "对方已经离线，求婚失败"
--[[--]]
ErrorId[2300015] = "对方已经不是你的好友"
--[[--]]
ErrorId[2300016] = "变身状态中，不可变性"
--[[--]]
ErrorId[2300017] = "战斗状态不可变性"
--[[--]]
ErrorId[2300018] = "不是主城，不可种植"
--[[--]]
ErrorId[2300019] = "种植不可批量使用"
--[[--]]
ErrorId[2300020] = "每天10-22点才可以种植"
--[[--]]
ErrorId[2300021] = "已达最大操作次数"
--[[--]]
ErrorId[2300022] = "姻缘树已消失"
--[[--]]
ErrorId[2300023] = "今天种植次数已达上限"
--[[--]]
ErrorId[2300024] = "未结婚，不可种植"
--[[--]]
ErrorId[2300025] = "心相印3阶才可以领取"
--[[--]]
ErrorId[2300026] = "心相印3阶才可以购买"
--[[--]]
ErrorId[2300027] = "该时段未开放！"
--[[--]]
ErrorId[2300028] = "该时段已经被预约！"
--[[--]]
ErrorId[2300029] = "请先预约婚宴！"
--[[--]]
ErrorId[2300030] = "烟花在婚宴中才能使用！"
--[[--]]
ErrorId[2300031] = "少侠没有请柬不可进入婚宴，可以尝试向婚宴主人索取请柬！"
--[[--]]
ErrorId[2300032] = "婚宴主人才能拜堂！"
--[[--]]
ErrorId[2300033] = "对方与你不再同一副本！"
--[[--]]
ErrorId[2300034] = "少侠稍安勿躁，婚宴暂未开启！"
--[[--]]
ErrorId[2300035] = "婚宴主人不能索要请柬！"
--[[--]]
ErrorId[2300036] = "不可重复索要请柬！"
--[[--]]
ErrorId[2300037] = "今日预约婚宴次数已达上限！"
--[[--]]
ErrorId[2300038] = "需举行完预约的婚礼后才可继续预约"
--[[--]]
ErrorId[2300039] = "已超出最大输入数，发布失败"
--[[--]]
ErrorId[2300040] = "你的输入内容中含有违规字符，发布失败"
--[[--]]
ErrorId[2300041] = "修改征婚宣言不要太频繁，稍后再发布吧"
--[[--]]
ErrorId[2300042] = "对方的好友数量已经达到上限，无法接受他人追求，赶快私聊Ta吧"
--[[--]]
ErrorId[2300043] = "你的好友数量已经达到上限，无法接受他人追求"
--[[--]]
ErrorId[2300044] = "你的好友数量已经达到上限，无法追求他人"
--[[--]]
ErrorId[2300045] = "对方已经寻得良缘，请换一个对象吧~"
--[[--]]
ErrorId[2300046] = "已向Ta表示了爱慕之情，请耐心等候回应"
--[[--]]
ErrorId[2300047] = "对同一异性追求只有3次机会"
--[[--]]
ErrorId[2300048] = "你的征婚宣言已经被其他玩家覆盖，赶紧重新发布吧"
--[[--]]
ErrorId[2300049] = "对方更改性别，无法与你共结良缘"
--[[--]]
ErrorId[2300050] = "性别不一致，无法共结良缘"
--[[--]]
ErrorId[2300051] = "对方宣言被覆盖"
--[[--]]
ErrorId[2300052] = "你没有输入征婚内容，发布失败"
--[[--]]
ErrorId[2300053] = "你们的订婚彩礼档次不足以举办这场婚礼，请重新选择！"
--[[--]]
ErrorId[2300054] = "洞房次数不足"
--[[--]]
ErrorId[2300055] = "家园等级不足"
--[[--]]
ErrorId[2300056] = "正在洞房中，请稍后"
--[[--]]
ErrorId[2300057] = "特殊场景中，不可进行洞房"
--[[--]]
ErrorId[2300058] = "对方在特殊场景，无法洞房"
--[[--]]
ErrorId[2300059] = "洞房超时，请重新进行洞房"
--[[--]]
ErrorId[2310001] = "对方正在双修"
--[[--]]
ErrorId[2310002] = "对方拒绝了你的双修邀请"
--[[--]]
ErrorId[2310003] = "正在双修中"
--[[--]]
ErrorId[2310004] = "修炼活动已结束"
--[[--]]
ErrorId[2310005] = "变身中不能双修"
--[[--]]
ErrorId[2310006] = "没有匹配到修炼对象"
--[[--]]
ErrorId[2310007] = "不在主城，无法获得修炼经验"
--[[--]]
ErrorId[2310008] = "对方已离开主城"
--[[--]]
ErrorId[2310009] = "对方处于变身状态，不可双修"
--[[主人正在潜修中,不能拜访!--]]
ErrorId[2320001] = "主人正在潜修中,不能拜访!"
--[[您不是主人,不能执行该操作!--]]
ErrorId[2320002] = "您不是主人,不能执行该操作!"
--[[不能搜索自己!--]]
ErrorId[2320003] = "不能搜索自己!"
--[[--]]
ErrorId[2330001] = "当前宠物拥有数量已达上限，请先放生或者交易"
--[[--]]
ErrorId[2330002] = "宠物装备已满级"
--[[--]]
ErrorId[2330003] = "宠物身上还有装备，请先卸下装备再操作"
--[[--]]
ErrorId[2330004] = "宠物品质限制，不可学习"
--[[--]]
ErrorId[2330005] = "宠物不存在"
--[[--]]
ErrorId[2330006] = "装备品质不得高于宠物品质"
--[[您已经申请过该队伍!--]]
ErrorId[2340001] = "您已经申请过该队伍!"
--[[您没有资格参加该排位赛!--]]
ErrorId[2340002] = "您没有资格参加该排位赛!"
--[[对方已经加入了战队!--]]
ErrorId[2340003] = "对方已经加入了战队!"
--[[对方没有参赛资格!--]]
ErrorId[2340004] = "对方没有参赛资格!"
--[[对方不在线!--]]
ErrorId[2340005] = "对方不在线!"
--[[该队伍不存在!--]]
ErrorId[2340006] = "该队伍不存在!"
--[[您已经加入战队,不能执行该操作!--]]
ErrorId[2340007] = "您已经加入战队,不能执行该操作!"
--[[已超过准备时间,不能进场!--]]
ErrorId[2340008] = "已超过准备时间,不能进场!"
--[[队伍已满员,不能执行该操作!--]]
ErrorId[2340009] = "队伍已满员,不能执行该操作!"
--[[该战队名称已存在!--]]
ErrorId[2340010] = "该战队名称已存在!"
--[[队友不在线,不能执行该操作!--]]
ErrorId[2340011] = "队友不在线,不能执行该操作!"
--[[季后赛期间,不能操作队伍!--]]
ErrorId[2340012] = "季后赛期间,不能操作队伍!"
--[[排位赛战队申请已达上限!--]]
ErrorId[2340013] = "排位赛战队申请已达上限!"
--[[本场比赛已结束!--]]
ErrorId[2340014] = "本场比赛已结束!"
--[[准备时间不能攻击!--]]
ErrorId[2340015] = "准备时间不能攻击!"
--[[当前不是报名阶段！--]]
ErrorId[2350001] = "当前不是报名阶段！"
--[[您的伴侣已经报名！--]]
ErrorId[2350002] = "您的伴侣已经报名！"
--[[队伍不存在！--]]
ErrorId[2350003] = "队伍不存在！"
--[[您已在匹配列表中！--]]
ErrorId[2350004] = "您已在匹配列表中！"
--[[当前不海选赛阶段！--]]
ErrorId[2350005] = "当前不海选赛阶段！"
--[[您已进入仙侣pk争霸赛对决，战完再离婚吧~~--]]
ErrorId[2350006] = "您已进入仙侣pk争霸赛对决，战完再离婚吧~~"
--[[该组比赛进行中，不能进行押注哦！--]]
ErrorId[2350007] = "该组比赛进行中，不能进行押注哦！"
--[[活动已结束！--]]
ErrorId[2350008] = "活动已结束！"
--[[不能押与自己同组的队伍！--]]
ErrorId[2350009] = "不能押与自己同组的队伍！"
--[[顶号了--]]
ErrorId[20010102] = "顶号了"
--[[礼包码类型在本周已经使用过--]]
ErrorId[20301019] = "在本周使用过此类礼包码"
--[[--]]
ErrorId[21010001] = "名字不合法!"
--[[--]]
ErrorId[21010002] = "名字长度不合法请重新输入"
--[[--]]
ErrorId[21010003] = "名字重复!"
--[[该玩家已经获得过改类型的礼包--]]
ErrorId[21070024] = "你已使用过此类型的礼包"
--[[--]]
ErrorId[21070025] = "物品剩余数量不足"
--[[--]]
ErrorId[21070026] = "超过购买次数"
--[[--]]
ErrorId[21070027] = "修仙活跃度不够！"
--[[--]]
ErrorId[21070028] = "重复领取！"
--[[全民全服秒杀，奖励与时间不对应--]]
ErrorId[21070029] = "全民全服秒杀，奖励与时间不对应"
--[[--]]
ErrorId[21090002] = "没有登录游戏"
--[[异常登录--]]
ErrorId[21090003] = "异常登录"
--[[ 验证失败,重新请求CpLogin--]]
ErrorId[21090005] = " 验证失败"
--[[Ip被封禁!详情请咨询客服微信公众号：mlgame--]]
ErrorId[21090006] = "Ip被封禁!详情请咨询客服微信公众号：mlgame"
--[[账号被封禁!详情请咨询客服微信公众号：mlgame--]]
ErrorId[21090007] = "账号被封禁!详情请咨询客服微信公众号：mlgame"
--[[该玩家不存在!--]]
ErrorId[21090008] = "该玩家不存在!"
--[[已经存在角色!--]]
ErrorId[21090009] = "已经存在角色!"
--[[疑似使用第三方辅助软件,请杜绝使用!--]]
ErrorId[21090010] = "检测你的网络不稳定，为了更好地体验游戏，请重新登陆！"
--[[--]]
ErrorId[21090011] = "请先选择玩家！"
--[[未创建角色!--]]
ErrorId[21100001] = "未创建角色!"
--[[--]]
ErrorId[21100002] = "未用!"
--[[--]]
ErrorId[22010001] = "背包已满!"
--[[--]]
ErrorId[22010002] = "仓库已满!"
--[[--]]
ErrorId[22010003] = "整理冷却中"
--[[--]]
ErrorId[22010004] = "背包空间不足"
--[[--]]
ErrorId[22010005] = "道具已过期"
--[[--]]
ErrorId[22010006] = "一次只能使用一个血包"
--[[--]]
ErrorId[22010007] = "道具已使用"
--[[--]]
ErrorId[22010008] = "装备不存在"
--[[--]]
ErrorId[22010009] = "超过使用上限"
--[[--]]
ErrorId[22010010] = "符文背包已满"
--[[该道具不能在该场景使用!--]]
ErrorId[22010011] = "该道具不能在该场景使用!"
--[[--]]
ErrorId[22010012] = "一次不能用太多了"
--[[--]]
ErrorId[22010013] = "今日仙缘果使用已达上限"
--[[--]]
ErrorId[22020002] = "等级不足"
--[[元宝不足!--]]
ErrorId[22020003] = "元宝不足!"
--[[铜钱不足!--]]
ErrorId[22020004] = "铜钱不足!"
--[[道具不足!--]]
ErrorId[22020005] = "道具不足!"
--[[--]]
ErrorId[22020006] = "绑定铜钱不足"
--[[绑定元宝不足!--]]
ErrorId[22020007] = "绑定元宝不足!"
--[[帮派贡献不足!--]]
ErrorId[22020008] = "仙盟贡献不足!"
--[[已经对该玩家点赞过了!--]]
ErrorId[22021001] = "已经对该玩家点赞过了!"
--[[--]]
ErrorId[22022001] = "您今日抢红包已达上限"
--[[对方不在线!--]]
ErrorId[22022002] = "对方不在线!"
--[[时间不足!--]]
ErrorId[22022003] = "练级谷可挂机时间不足！"
--[[已经处于打坐状态!--]]
ErrorId[22022004] = "已经处于打坐状态!"
--[[战斗状态不能打坐!--]]
ErrorId[22022005] = "战斗状态不能打坐!"
--[[--]]
ErrorId[22022006] = "请不要说话太快！"
--[[--]]
ErrorId[22022007] = "荣誉值不足"
--[[--]]
ErrorId[22022008] = "禁言中"
--[[--]]
ErrorId[22022009] = "任务已完成"
--[[--]]
ErrorId[22022010] = "对方等级过低，无法PK"
--[[--]]
ErrorId[22022011] = "历练不足！"
--[[--]]
ErrorId[22022012] = "功勋不足"
--[[--]]
ErrorId[22022013] = "任务已过期"
--[[--]]
ErrorId[22022014] = "获得箱子后充值任意元宝可开启！"
--[[--]]
ErrorId[22022015] = "血包未消耗完毕，无法使用！"
--[[钻石特权尚未获得!--]]
ErrorId[22022016] = "请先激活钻石仙尊"
--[[黄金特权尚未获得!--]]
ErrorId[22022017] = "请先激活黄金仙尊"
--[[白银特权尚未获得!--]]
ErrorId[22022018] = "请先激活白银仙尊"
--[[今日意见提交次数已达上限!--]]
ErrorId[22022019] = "今日意见反馈提交次数已达上限!"
--[[bug提交今日已达上限!--]]
ErrorId[22022020] = "今日bug反馈提交次数已达上限!"
--[[意见提交过快,请稍后再试!--]]
ErrorId[22022021] = "意见提交过快,请稍后再试!"
--[[bug提交过快,请稍后再试!--]]
ErrorId[22022022] = "bug提交过快,请稍后再试!"
--[[--]]
ErrorId[22022023] = "请先退出当前场景"
--[[--]]
ErrorId[22022024] = "激活仙尊卡后，可增加购买次数！"
--[[--]]
ErrorId[22022025] = "仓库令不足，将古董存入仙盟仓库可获得仓库令"
--[[渡劫挑战冷却中!--]]
ErrorId[22022026] = "渡劫挑战冷却中!"
--[[队友护法次数已用完!--]]
ErrorId[22022027] = "队友护法次数已用完!"
--[[--]]
ErrorId[22022028] = "声望不足"
--[[--]]
ErrorId[22022029] = "威名不足！"
--[[家园币不足!--]]
ErrorId[22022030] = "家园币不足!"
--[[--]]
ErrorId[22022031] = "你已死亡"
--[[游历修为不足！--]]
ErrorId[22022032] = "游历修为不足！"
--[[灵核结晶不足！--]]
ErrorId[22022033] = "灵核结晶不足！"
--[[不同挑战比您仙位低的选手！--]]
ErrorId[22022034] = "不同挑战比您仙位低的选手！"
--[[该玩家正在挑战中,请稍后再试！--]]
ErrorId[22022035] = "该玩家正在挑战中,请稍后再试！"
--[[您当前位置正在被挑战中！--]]
ErrorId[22022036] = "您当前位置正在被挑战中！"
--[[该采集物今日采集已达上限!--]]
ErrorId[22022037] = "该采集物今日采集已达上限!"
--[[未获得挑战麒麟的资格！--]]
ErrorId[22022038] = "未获得挑战麒麟的资格！"
--[[兽神祭坛暂未开启！--]]
ErrorId[22022039] = "兽神祭坛暂未开启！"
--[[兽神祭坛入口已关闭！--]]
ErrorId[22022040] = "兽神祭坛入口已关闭！"
--[[--]]
ErrorId[22062024] = "今日红包已领铜钱达最大"
--[[--]]
ErrorId[22062025] = "您不是盟主，不能进行此操作！"
--[[--]]
ErrorId[22062026] = "仙盟已解散"
--[[--]]
ErrorId[22062027] = "道具已被销毁！"
--[[--]]
ErrorId[22062028] = "古董取出数量已达上限！"
--[[--]]
ErrorId[22062029] = "添柴次数已达最大"
--[[--]]
ErrorId[22062030] = "固定道具不能销毁！"
--[[--]]
ErrorId[22062031] = "道具不能存入！"
--[[--]]
ErrorId[22062032] = "仙盟圣火时间不能进行此操作"
--[[--]]
ErrorId[22062033] = "答题时间已过"
--[[--]]
ErrorId[22062034] = "盟主、副盟主及长老才可以进行升级操作"

return ErrorId